garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG7" edc:desc="Configuration byte 7" edc:factorydefault="0xFF" edc:impl="0xff" edc:name="CONFIG7" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFF" edc:default="0xFF" edc:_addr="0x300006">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BBSIZE" edc:desc="Boot Block Size Selection bits" edc:mask="0xff" edc:name="BBSIZE" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="BBSIZE_16384" edc:desc="Boot Block size is 16384 words" edc:when="(field &amp; 0xff) == 0x7f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_16256" edc:desc="Boot Block size is 16256 words" edc:when="(field &amp; 0xff) == 0x7e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_16128" edc:desc="Boot Block size is 16128 words" edc:when="(field &amp; 0xff) == 0x7d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_16000" edc:desc="Boot Block size is 16000 words" edc:when="(field &amp; 0xff) == 0x7c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_15872" edc:desc="Boot Block size is 15872 words" edc:when="(field &amp; 0xff) == 0x7b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_15744" edc:desc="Boot Block size is 15744 words" edc:when="(field &amp; 0xff) == 0x7a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_15616" edc:desc="Boot Block size is 15616 words" edc:when="(field &amp; 0xff) == 0x79"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_15488" edc:desc="Boot Block size is 15488 words" edc:when="(field &amp; 0xff) == 0x78"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_15360" edc:desc="Boot Block size is 15360 words" edc:when="(field &amp; 0xff) == 0x77"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_15232" edc:desc="Boot Block size is 15232 words" edc:when="(field &amp; 0xff) == 0x76"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_15104" edc:desc="Boot Block size is 15104 words" edc:when="(field &amp; 0xff) == 0x75"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14976" edc:desc="Boot Block size is 14976 words" edc:when="(field &amp; 0xff) == 0x74"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14848" edc:desc="Boot Block size is 14848 words" edc:when="(field &amp; 0xff) == 0x73"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14720" edc:desc="Boot Block size is 14720 words" edc:when="(field &amp; 0xff) == 0x72"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14592" edc:desc="Boot Block size is 14592 words" edc:when="(field &amp; 0xff) == 0x71"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14464" edc:desc="Boot Block size is 14464 words" edc:when="(field &amp; 0xff) == 0x70"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14336" edc:desc="Boot Block size is 14336 words" edc:when="(field &amp; 0xff) == 0x6f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14208" edc:desc="Boot Block size is 14208 words" edc:when="(field &amp; 0xff) == 0x6e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_14080" edc:desc="Boot Block size is 14080 words" edc:when="(field &amp; 0xff) == 0x6d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13952" edc:desc="Boot Block size is 13952 words" edc:when="(field &amp; 0xff) == 0x6c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13824" edc:desc="Boot Block size is 13824 words" edc:when="(field &amp; 0xff) == 0x6b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13696" edc:desc="Boot Block size is 13696 words" edc:when="(field &amp; 0xff) == 0x6a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13568" edc:desc="Boot Block size is 13568 words" edc:when="(field &amp; 0xff) == 0x69"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13440" edc:desc="Boot Block size is 13440 words" edc:when="(field &amp; 0xff) == 0x68"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13312" edc:desc="Boot Block size is 13312 words" edc:when="(field &amp; 0xff) == 0x67"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13184" edc:desc="Boot Block size is 13184 words" edc:when="(field &amp; 0xff) == 0x66"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_13056" edc:desc="Boot Block size is 13056 words" edc:when="(field &amp; 0xff) == 0x65"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12928" edc:desc="Boot Block size is 12928 words" edc:when="(field &amp; 0xff) == 0x64"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12800" edc:desc="Boot Block size is 12800 words" edc:when="(field &amp; 0xff) == 0x63"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12672" edc:desc="Boot Block size is 12672 words" edc:when="(field &amp; 0xff) == 0x62"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12544" edc:desc="Boot Block size is 12544 words" edc:when="(field &amp; 0xff) == 0x61"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12416" edc:desc="Boot Block size is 12416 words" edc:when="(field &amp; 0xff) == 0x60"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12288" edc:desc="Boot Block size is 12288 words" edc:when="(field &amp; 0xff) == 0x5f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12160" edc:desc="Boot Block size is 12160 words" edc:when="(field &amp; 0xff) == 0x5e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_12032" edc:desc="Boot Block size is 12032 words" edc:when="(field &amp; 0xff) == 0x5d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11904" edc:desc="Boot Block size is 11904 words" edc:when="(field &amp; 0xff) == 0x5c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11776" edc:desc="Boot Block size is 11776 words" edc:when="(field &amp; 0xff) == 0x5b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11648" edc:desc="Boot Block size is 11648 words" edc:when="(field &amp; 0xff) == 0x5a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11520" edc:desc="Boot Block size is 11520 words" edc:when="(field &amp; 0xff) == 0x59"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11392" edc:desc="Boot Block size is 11392 words" edc:when="(field &amp; 0xff) == 0x58"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11264" edc:desc="Boot Block size is 11264 words" edc:when="(field &amp; 0xff) == 0x57"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11136" edc:desc="Boot Block size is 11136 words" edc:when="(field &amp; 0xff) == 0x56"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_11008" edc:desc="Boot Block size is 11008 words" edc:when="(field &amp; 0xff) == 0x55"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_10880" edc:desc="Boot Block size is 10880 words" edc:when="(field &amp; 0xff) == 0x54"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_10752" edc:desc="Boot Block size is 10752 words" edc:when="(field &amp; 0xff) == 0x53"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_10624" edc:desc="Boot Block size is 10624 words" edc:when="(field &amp; 0xff) == 0x52"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_10496" edc:desc="Boot Block size is 10496 words" edc:when="(field &amp; 0xff) == 0x51"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_10368" edc:desc="Boot Block size is 10368 words" edc:when="(field &amp; 0xff) == 0x50"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_10240" edc:desc="Boot Block size is 10240 words" edc:when="(field &amp; 0xff) == 0x4f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_10112" edc:desc="Boot Block size is 10112 words" edc:when="(field &amp; 0xff) == 0x4e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9984" edc:desc="Boot Block size is 9984 words" edc:when="(field &amp; 0xff) == 0x4d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9856" edc:desc="Boot Block size is 9856 words" edc:when="(field &amp; 0xff) == 0x4c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9728" edc:desc="Boot Block size is 9728 words" edc:when="(field &amp; 0xff) == 0x4b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9600" edc:desc="Boot Block size is 9600 words" edc:when="(field &amp; 0xff) == 0x4a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9472" edc:desc="Boot Block size is 9472 words" edc:when="(field &amp; 0xff) == 0x49"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9344" edc:desc="Boot Block size is 9344 words" edc:when="(field &amp; 0xff) == 0x48"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9216" edc:desc="Boot Block size is 9216 words" edc:when="(field &amp; 0xff) == 0x47"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_9088" edc:desc="Boot Block size is 9088 words" edc:when="(field &amp; 0xff) == 0x46"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8960" edc:desc="Boot Block size is 8960 words" edc:when="(field &amp; 0xff) == 0x45"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8832" edc:desc="Boot Block size is 8832 words" edc:when="(field &amp; 0xff) == 0x44"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8704" edc:desc="Boot Block size is 8704 words" edc:when="(field &amp; 0xff) == 0x43"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8576" edc:desc="Boot Block size is 8576 words" edc:when="(field &amp; 0xff) == 0x42"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8448" edc:desc="Boot Block size is 8448 words" edc:when="(field &amp; 0xff) == 0x41"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8320" edc:desc="Boot Block size is 8320 words" edc:when="(field &amp; 0xff) == 0x40"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8192" edc:desc="Boot Block size is 8192 words" edc:when="(field &amp; 0xff) == 0x3f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_8064" edc:desc="Boot Block size is 8064 words" edc:when="(field &amp; 0xff) == 0x3e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7936" edc:desc="Boot Block size is 7936 words" edc:when="(field &amp; 0xff) == 0x3d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7808" edc:desc="Boot Block size is 7808 words" edc:when="(field &amp; 0xff) == 0x3c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7680" edc:desc="Boot Block size is 7680 words" edc:when="(field &amp; 0xff) == 0x3b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7552" edc:desc="Boot Block size is 7552 words" edc:when="(field &amp; 0xff) == 0x3a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7424" edc:desc="Boot Block size is 7424 words" edc:when="(field &amp; 0xff) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7296" edc:desc="Boot Block size is 7296 words" edc:when="(field &amp; 0xff) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7168" edc:desc="Boot Block size is 7168 words" edc:when="(field &amp; 0xff) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_7040" edc:desc="Boot Block size is 7040 words" edc:when="(field &amp; 0xff) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6912" edc:desc="Boot Block size is 6912 words" edc:when="(field &amp; 0xff) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6784" edc:desc="Boot Block size is 6784 words" edc:when="(field &amp; 0xff) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6656" edc:desc="Boot Block size is 6656 words" edc:when="(field &amp; 0xff) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6528" edc:desc="Boot Block size is 6528 words" edc:when="(field &amp; 0xff) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6400" edc:desc="Boot Block size is 6400 words" edc:when="(field &amp; 0xff) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6272" edc:desc="Boot Block size is 6272 words" edc:when="(field &amp; 0xff) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6144" edc:desc="Boot Block size is 6144 words" edc:when="(field &amp; 0xff) == 0x2f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_6016" edc:desc="Boot Block size is 6016 words" edc:when="(field &amp; 0xff) == 0x2e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_5888" edc:desc="Boot Block size is 5888 words" edc:when="(field &amp; 0xff) == 0x2d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_5760" edc:desc="Boot Block size is 5760 words" edc:when="(field &amp; 0xff) == 0x2c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_5632" edc:desc="Boot Block size is 5632 words" edc:when="(field &amp; 0xff) == 0x2b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_5504" edc:desc="Boot Block size is 5504 words" edc:when="(field &amp; 0xff) == 0x2a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_5376" edc:desc="Boot Block size is 5376 words" edc:when="(field &amp; 0xff) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_5248" edc:desc="Boot Block size is 5248 words" edc:when="(field &amp; 0xff) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_5120" edc:desc="Boot Block size is 5120 words" edc:when="(field &amp; 0xff) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4992" edc:desc="Boot Block size is 4992 words" edc:when="(field &amp; 0xff) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4864" edc:desc="Boot Block size is 4864 words" edc:when="(field &amp; 0xff) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4736" edc:desc="Boot Block size is 4736 words" edc:when="(field &amp; 0xff) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4608" edc:desc="Boot Block size is 4608 words" edc:when="(field &amp; 0xff) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4480" edc:desc="Boot Block size is 4480 words" edc:when="(field &amp; 0xff) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4352" edc:desc="Boot Block size is 4352 words" edc:when="(field &amp; 0xff) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4224" edc:desc="Boot Block size is 4224 words" edc:when="(field &amp; 0xff) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_4096" edc:desc="Boot Block size is 4096 words" edc:when="(field &amp; 0xff) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3968" edc:desc="Boot Block size is 3968 words" edc:when="(field &amp; 0xff) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3840" edc:desc="Boot Block size is 3840 words" edc:when="(field &amp; 0xff) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3712" edc:desc="Boot Block size is 3712 words" edc:when="(field &amp; 0xff) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3584" edc:desc="Boot Block size is 3584 words" edc:when="(field &amp; 0xff) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3456" edc:desc="Boot Block size is 3456 words" edc:when="(field &amp; 0xff) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3328" edc:desc="Boot Block size is 3328 words" edc:when="(field &amp; 0xff) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3200" edc:desc="Boot Block size is 3200 words" edc:when="(field &amp; 0xff) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_3072" edc:desc="Boot Block size is 3072 words" edc:when="(field &amp; 0xff) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2944" edc:desc="Boot Block size is 2944 words" edc:when="(field &amp; 0xff) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2816" edc:desc="Boot Block size is 2816 words" edc:when="(field &amp; 0xff) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2688" edc:desc="Boot Block size is 2688 words" edc:when="(field &amp; 0xff) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2560" edc:desc="Boot Block size is 2560 words" edc:when="(field &amp; 0xff) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2432" edc:desc="Boot Block size is 2432 words" edc:when="(field &amp; 0xff) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2304" edc:desc="Boot Block size is 2304 words" edc:when="(field &amp; 0xff) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2176" edc:desc="Boot Block size is 2176 words" edc:when="(field &amp; 0xff) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_2048" edc:desc="Boot Block size is 2048 words" edc:when="(field &amp; 0xff) == 0x0f"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1920" edc:desc="Boot Block size is 1920 words" edc:when="(field &amp; 0xff) == 0x0e"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1792" edc:desc="Boot Block size is 1792 words" edc:when="(field &amp; 0xff) == 0x0d"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1664" edc:desc="Boot Block size is 1664 words" edc:when="(field &amp; 0xff) == 0x0c"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1536" edc:desc="Boot Block size is 1536 words" edc:when="(field &amp; 0xff) == 0x0b"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1408" edc:desc="Boot Block size is 1408 words" edc:when="(field &amp; 0xff) == 0x0a"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1280" edc:desc="Boot Block size is 1280 words" edc:when="(field &amp; 0xff) == 0x09"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1152" edc:desc="Boot Block size is 1152 words" edc:when="(field &amp; 0xff) == 0x08"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_1024" edc:desc="Boot Block size is 1024 words" edc:when="(field &amp; 0xff) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_896" edc:desc="Boot Block size is 896 words" edc:when="(field &amp; 0xff) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_768" edc:desc="Boot Block size is 768 words" edc:when="(field &amp; 0xff) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_640" edc:desc="Boot Block size is 640 words" edc:when="(field &amp; 0xff) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_512" edc:desc="Boot Block size is 512 words" edc:when="(field &amp; 0xff) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_384" edc:desc="Boot Block size is 384 words" edc:when="(field &amp; 0xff) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_256" edc:desc="Boot Block size is 256 words" edc:when="(field &amp; 0xff) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="BBSIZE_128" edc:desc="Boot Block size is 128 words" edc:when="(field &amp; 0xff) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG8" edc:desc="Configuration byte 8" edc:factorydefault="0xFF" edc:impl="0xff" edc:name="CONFIG8" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFF" edc:default="0xFF" edc:_addr="0x300007">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SAFSZ" edc:desc="SAF Block Size Selection bits" edc:mask="0xff" edc:name="SAFSZ" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="SAFSZ_NONE" edc:desc="NONE" edc:when="(field &amp; 0xff) == 0xff"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_128" edc:desc="Last 128 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xfe"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_256" edc:desc="Last 256 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xfC"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_384" edc:desc="Last 384 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xf8"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_512" edc:desc="Last 512 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xf0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_640" edc:desc="Last 640 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xe0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_768" edc:desc="Last 768 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0xC0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_896" edc:desc="Last 896 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0x80"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_1024" edc:desc="Last 1024 words of PFM; self write operation depends on WRTSAF bit in CONFIG9" edc:when="(field &amp; 0xff) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n---nnnn" edc:cname="CONFIG9" edc:desc="Configuration byte 9" edc:factorydefault="0xFF" edc:impl="0x8F" edc:name="CONFIG9" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x8F" edc:default="0xFF" edc:_addr="0x300008">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WRTB" edc:desc="Boot Block Write Protection bit" edc:mask="0x1" edc:name="WRTB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block not Write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block Write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTC" edc:desc="Configuration Register Write Protection bit" edc:mask="0x1" edc:name="WRTC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration registers not Write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration registers Write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTD" edc:desc="Data EEPROM Write Protection bit" edc:mask="0x1" edc:name="WRTD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not Write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM Write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTSAF" edc:desc="SAF Write protection bit" edc:mask="0x1" edc:name="WRTSAF" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SAF not Write Protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SAF Write Protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="WRTAPP" edc:desc="Application Block write protection bit" edc:mask="0x1" edc:name="WRTAPP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Application Block not write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Application Block write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
