garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OSCCON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OSCCON1" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0xAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NDIV" edc:mask="0xf" edc:name="NDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NDIV0" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV1" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV2" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV3" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="OSCCON2" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OSCCON2" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0xAE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CDIV" edc:mask="0xf" edc:name="CDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:mask="0x7" edc:name="COSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CDIV0" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV1" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV2" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV3" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-rr---" edc:cname="OSCCON3" edc:desc="" edc:impl="0xd8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01-00---" edc:name="OSCCON3" edc:nzwidth="8" edc:por="01-00---" edc:_addr="0xAF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOSCR" edc:mask="0x1" edc:name="NOSCR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORDY" edc:mask="0x1" edc:name="ORDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSCPWR" edc:mask="0x1" edc:name="SOSCPWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWHOLD" edc:mask="0x1" edc:name="CSWHOLD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="OSCTUNE" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="OSCTUNE" edc:nzwidth="8" edc:por="--000000" edc:_addr="0xB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN5" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OSCFRQ" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OSCFRQ" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xB1">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="OSCFREQ"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HFFRQ" edc:mask="0xf" edc:name="HFFRQ" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FRQ0" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRQ1" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRQ2" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRQ3" edc:mask="0x1" edc:name="FRQ0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrr-r" edc:cname="OSCSTAT" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-0" edc:name="OSCSTAT" edc:nzwidth="8" edc:por="000000-0" edc:_addr="0xB2">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="OSCSTAT1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLR" edc:mask="0x1" edc:name="PLLR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADOR" edc:mask="0x1" edc:name="ADOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOR" edc:mask="0x1" edc:name="SOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFOR" edc:mask="0x1" edc:name="LFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MFOR" edc:mask="0x1" edc:name="MFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HFOR" edc:mask="0x1" edc:name="HFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTOR" edc:mask="0x1" edc:name="EXTOR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
