garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="ADCGE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="ADCGE" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x114">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGE0" edc:mask="0x1" edc:name="CGE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGE1" edc:mask="0x1" edc:name="CGE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGE2" edc:mask="0x1" edc:name="CGE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGE0" edc:mask="0x1" edc:name="ADCGE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGE1" edc:mask="0x1" edc:name="ADCGE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGE2" edc:mask="0x1" edc:name="ADCGE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGF" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x115">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGF0" edc:mask="0x1" edc:name="CGF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGF1" edc:mask="0x1" edc:name="CGF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGF2" edc:mask="0x1" edc:name="CGF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGF3" edc:mask="0x1" edc:name="CGF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGF4" edc:mask="0x1" edc:name="CGF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGF5" edc:mask="0x1" edc:name="CGF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGF6" edc:mask="0x1" edc:name="CGF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGF7" edc:mask="0x1" edc:name="CGF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGF0" edc:mask="0x1" edc:name="ADCGF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGF1" edc:mask="0x1" edc:name="ADCGF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGF2" edc:mask="0x1" edc:name="ADCGF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGF3" edc:mask="0x1" edc:name="ADCGF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGF4" edc:mask="0x1" edc:name="ADCGF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGF5" edc:mask="0x1" edc:name="ADCGF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGF6" edc:mask="0x1" edc:name="ADCGF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGF7" edc:mask="0x1" edc:name="ADCGF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x9" edc:_addr="0x116"/>
        <edc:SFRDef edc:access="n-n-n---" edc:cname="OPA1CON0" edc:desc="" edc:impl="0xa8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0---" edc:name="OPA1CON0" edc:nzwidth="8" edc:por="0-0-0---" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x11F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="UG" edc:mask="0x1" edc:name="UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CPON" edc:mask="0x1" edc:name="CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="UG0" edc:mask="0x1" edc:name="UG0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPA1UG" edc:mask="0x1" edc:name="OPA1UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1CPON" edc:mask="0x1" edc:name="OPA1CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1EN" edc:desc="" edc:mask="0x1" edc:name="OPA1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OPA1CON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OPA1CON1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x120">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:mask="0x7" edc:name="NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="RESON" edc:mask="0x1" edc:name="RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL" edc:mask="0x7" edc:name="GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS2" edc:mask="0x1" edc:name="NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL0" edc:mask="0x1" edc:name="GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL1" edc:mask="0x1" edc:name="GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL2" edc:mask="0x1" edc:name="GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1NSS" edc:mask="0x7" edc:name="OPA1NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1RESON" edc:mask="0x1" edc:name="OPA1RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL" edc:mask="0x7" edc:name="OPA1GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1NSS0" edc:mask="0x1" edc:name="OPA1NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NSS1" edc:mask="0x1" edc:name="OPA1NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NSS2" edc:mask="0x1" edc:name="OPA1NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL0" edc:mask="0x1" edc:name="OPA1GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL1" edc:mask="0x1" edc:name="OPA1GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL2" edc:mask="0x1" edc:name="OPA1GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="OPA1CON2" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="OPA1CON2" edc:nzwidth="8" edc:por="-000-000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x121">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:mask="0x7" edc:name="PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCH" edc:mask="0x7" edc:name="NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCH0" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH0" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PCH" edc:mask="0x7" edc:name="OPA1PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH" edc:mask="0x7" edc:name="OPA1NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1PCH0" edc:mask="0x1" edc:name="OPA1PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PCH1" edc:mask="0x1" edc:name="OPA1PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PCH2" edc:mask="0x1" edc:name="OPA1PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH0" edc:mask="0x1" edc:name="OPA1NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH1" edc:mask="0x1" edc:name="OPA1NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH2" edc:mask="0x1" edc:name="OPA1NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA1CON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00uuuuuu" edc:name="OPA1CON3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x122">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS" edc:mask="0x1f" edc:name="PSS" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="INTOE" edc:mask="0x1" edc:name="INTOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS" edc:mask="0x3" edc:name="FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS2" edc:mask="0x1" edc:name="PSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS3" edc:mask="0x1" edc:name="PSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS4" edc:mask="0x1" edc:name="PSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS0" edc:mask="0x1" edc:name="FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS1" edc:mask="0x1" edc:name="FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PSS" edc:mask="0x1f" edc:name="OPA1PSS" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="OPA1INTOE" edc:mask="0x1" edc:name="OPA1INTOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS" edc:mask="0x3" edc:name="OPA1FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1PSS0" edc:mask="0x1" edc:name="OPA1PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PSS1" edc:mask="0x1" edc:name="OPA1PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PSS2" edc:mask="0x1" edc:name="OPA1PSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PSS3" edc:mask="0x1" edc:name="OPA1PSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PSS4" edc:mask="0x1" edc:name="OPA1PSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS0" edc:mask="0x1" edc:name="OPA1FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS1" edc:mask="0x1" edc:name="OPA1FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="OPA1CON4" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---u-uuu" edc:name="OPA1CON4" edc:nzwidth="8" edc:por="---x-0xx" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x123">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFCSEL" edc:mask="0x3" edc:name="OFCSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OFCST" edc:mask="0x1" edc:name="OFCST" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PTRES" edc:mask="0x1" edc:name="PTRES" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OFCSEL0" edc:mask="0x1" edc:name="OFCSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFCSEL1" edc:mask="0x1" edc:name="OFCSEL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1OFCSEL" edc:mask="0x3" edc:name="OPA1OFCSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OPA1OFCST" edc:mask="0x1" edc:name="OPA1OFCST" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PTRES" edc:mask="0x1" edc:name="OPA1PTRES" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1OFCSEL0" edc:mask="0x1" edc:name="OPA1OFCSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFCSEL1" edc:mask="0x1" edc:name="OPA1OFCSEL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA1HWC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA1HWC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x124">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HWCL" edc:mask="0x7" edc:name="HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH" edc:mask="0x7" edc:name="HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OREN" edc:mask="0x1" edc:name="OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HWCL0" edc:mask="0x1" edc:name="HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL1" edc:mask="0x1" edc:name="HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL2" edc:mask="0x1" edc:name="HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HWCH0" edc:mask="0x1" edc:name="HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH1" edc:mask="0x1" edc:name="HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH2" edc:mask="0x1" edc:name="HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1HWCL" edc:mask="0x7" edc:name="OPA1HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1ORPOL" edc:mask="0x1" edc:name="OPA1ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH" edc:mask="0x7" edc:name="OPA1HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1OREN" edc:mask="0x1" edc:name="OPA1OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1HWCL0" edc:mask="0x1" edc:name="OPA1HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCL1" edc:mask="0x1" edc:name="OPA1HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCL2" edc:mask="0x1" edc:name="OPA1HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH0" edc:mask="0x1" edc:name="OPA1HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH1" edc:mask="0x1" edc:name="OPA1HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH2" edc:mask="0x1" edc:name="OPA1HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
