garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
        <edc:JoinedSFRDef edc:cname="APMPER" edc:desc="" edc:name="APMPER" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C3">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C3">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PER" edc:mask="0xff" edc:name="PER" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PER0" edc:mask="0x1" edc:name="PER0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER1" edc:mask="0x1" edc:name="PER1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER2" edc:mask="0x1" edc:name="PER2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER3" edc:mask="0x1" edc:name="PER3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER4" edc:mask="0x1" edc:name="PER4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER5" edc:mask="0x1" edc:name="PER5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER6" edc:mask="0x1" edc:name="PER6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER7" edc:mask="0x1" edc:name="PER7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPER" edc:mask="0xff" edc:name="APMPER" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="APMPER0" edc:mask="0x1" edc:name="APMPER0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER1" edc:mask="0x1" edc:name="APMPER1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER2" edc:mask="0x1" edc:name="APMPER2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER3" edc:mask="0x1" edc:name="APMPER3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER4" edc:mask="0x1" edc:name="APMPER4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER5" edc:mask="0x1" edc:name="APMPER5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER6" edc:mask="0x1" edc:name="APMPER6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER7" edc:mask="0x1" edc:name="APMPER7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C4">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PER" edc:mask="0xff" edc:name="PER" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PER8" edc:mask="0x1" edc:name="PER8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER9" edc:mask="0x1" edc:name="PER9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER10" edc:mask="0x1" edc:name="PER10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER11" edc:mask="0x1" edc:name="PER11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER12" edc:mask="0x1" edc:name="PER12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER13" edc:mask="0x1" edc:name="PER13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER14" edc:mask="0x1" edc:name="PER14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PER15" edc:mask="0x1" edc:name="PER15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPER" edc:mask="0xff" edc:name="APMPER" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="APMPER8" edc:mask="0x1" edc:name="APMPER8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER9" edc:mask="0x1" edc:name="APMPER9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER10" edc:mask="0x1" edc:name="APMPER10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER11" edc:mask="0x1" edc:name="APMPER11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER12" edc:mask="0x1" edc:name="APMPER12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER13" edc:mask="0x1" edc:name="APMPER13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER14" edc:mask="0x1" edc:name="APMPER14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPER15" edc:mask="0x1" edc:name="APMPER15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMSTART1" edc:desc="" edc:name="APMSTART1" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C5">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMSTART1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMSTART1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C5">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="START1" edc:mask="0xff" edc:name="START1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMSTART1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMSTART1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C6">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="START1" edc:mask="0xff" edc:name="START1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMPERS1" edc:desc="" edc:name="APMPERS1" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C7">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERS1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERS1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C7">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMPERS1" edc:mask="0xff" edc:name="APMPERS1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="BG" edc:mask="0x1" edc:name="BG" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR1" edc:mask="0x1" edc:name="FVR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FVR2" edc:mask="0x1" edc:name="FVR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCD" edc:mask="0x1" edc:name="ADCD" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADCA" edc:mask="0x1" edc:name="ADCA" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TEMP" edc:mask="0x1" edc:name="TEMP" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_2" edc:mask="0x1" edc:name="APMPERS1_2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_3" edc:mask="0x1" edc:name="APMPERS1_3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_4" edc:mask="0x1" edc:name="APMPERS1_4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_5" edc:mask="0x1" edc:name="APMPERS1_5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_6" edc:mask="0x1" edc:name="APMPERS1_6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_7" edc:mask="0x1" edc:name="APMPERS1_7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPERS1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPERS1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C8">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMPERS1" edc:mask="0xff" edc:name="APMPERS1" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="OPA1" edc:mask="0x1" edc:name="OPA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="OPA2" edc:mask="0x1" edc:name="OPA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1" edc:mask="0x1" edc:name="DAC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2" edc:mask="0x1" edc:name="DAC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3" edc:mask="0x1" edc:name="DAC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP1" edc:mask="0x1" edc:name="CMP1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP2" edc:mask="0x1" edc:name="CMP2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ZCD" edc:mask="0x1" edc:name="ZCD" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPERS1_8" edc:mask="0x1" edc:name="APMPERS1_8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_9" edc:mask="0x1" edc:name="APMPERS1_9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_10" edc:mask="0x1" edc:name="APMPERS1_10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_11" edc:mask="0x1" edc:name="APMPERS1_11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_12" edc:mask="0x1" edc:name="APMPERS1_12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_13" edc:mask="0x1" edc:name="APMPERS1_13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_14" edc:mask="0x1" edc:name="APMPERS1_14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPERS1_15" edc:mask="0x1" edc:name="APMPERS1_15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="APMSTART2" edc:desc="" edc:name="APMSTART2" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C9">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMSTART2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMSTART2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C9">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="START2" edc:mask="0xff" edc:name="START2" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
