garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RC3I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RC3I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-05032_pad_8bit_i2c_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x288">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I2C1RXB" edc:desc="I2C RECEIVE BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1RXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x289">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="I2C1TXB" edc:desc="I2C TRANSMIT BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I2C1CNT" edc:desc="" edc:name="I2C1CNT" edc:nzwidth="0x10" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28B">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1CNTL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CNT0" edc:mask="0x1" edc:name="CNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT1" edc:mask="0x1" edc:name="CNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT2" edc:mask="0x1" edc:name="CNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT3" edc:mask="0x1" edc:name="CNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT4" edc:mask="0x1" edc:name="CNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT5" edc:mask="0x1" edc:name="CNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT6" edc:mask="0x1" edc:name="CNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT7" edc:mask="0x1" edc:name="CNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="I2C1CNT" edc:mask="0xff" edc:name="I2C1CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="I2C1CNT0" edc:mask="0x1" edc:name="I2C1CNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT1" edc:mask="0x1" edc:name="I2C1CNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT2" edc:mask="0x1" edc:name="I2C1CNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT3" edc:mask="0x1" edc:name="I2C1CNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT4" edc:mask="0x1" edc:name="I2C1CNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT5" edc:mask="0x1" edc:name="I2C1CNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT6" edc:mask="0x1" edc:name="I2C1CNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT7" edc:mask="0x1" edc:name="I2C1CNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CNTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1CNTH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CNT8" edc:mask="0x1" edc:name="CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT9" edc:mask="0x1" edc:name="CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT10" edc:mask="0x1" edc:name="CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT11" edc:mask="0x1" edc:name="CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT12" edc:mask="0x1" edc:name="CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT13" edc:mask="0x1" edc:name="CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT14" edc:mask="0x1" edc:name="CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT15" edc:mask="0x1" edc:name="CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="I2C1CNT" edc:mask="0xff" edc:name="I2C1CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="I2C1CNT8" edc:mask="0x1" edc:name="I2C1CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT9" edc:mask="0x1" edc:name="I2C1CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT10" edc:mask="0x1" edc:name="I2C1CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT11" edc:mask="0x1" edc:name="I2C1CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT12" edc:mask="0x1" edc:name="I2C1CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT13" edc:mask="0x1" edc:name="I2C1CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT14" edc:mask="0x1" edc:name="I2C1CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT15" edc:mask="0x1" edc:name="I2C1CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
