garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1INCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1INCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x444">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xff" edc:name="INC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC8" edc:desc="" edc:mask="0x1" edc:name="NCO1INC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC9" edc:desc="" edc:mask="0x1" edc:name="NCO1INC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC10" edc:desc="" edc:mask="0x1" edc:name="NCO1INC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC11" edc:desc="" edc:mask="0x1" edc:name="NCO1INC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC12" edc:desc="" edc:mask="0x1" edc:name="NCO1INC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC13" edc:desc="" edc:mask="0x1" edc:name="NCO1INC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC14" edc:desc="" edc:mask="0x1" edc:name="NCO1INC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC15" edc:desc="" edc:mask="0x1" edc:name="NCO1INC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC8" edc:mask="0x1" edc:name="INC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC9" edc:mask="0x1" edc:name="INC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC10" edc:mask="0x1" edc:name="INC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC11" edc:mask="0x1" edc:name="INC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC12" edc:mask="0x1" edc:name="INC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC13" edc:mask="0x1" edc:name="INC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC14" edc:mask="0x1" edc:name="INC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC15" edc:mask="0x1" edc:name="INC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:mask="0xff" edc:name="NCO1INC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO1INCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO1INCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x445">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xf" edc:name="INC" edc:nzwidth="4"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC16" edc:desc="" edc:mask="0x1" edc:name="NCO1INC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC17" edc:desc="" edc:mask="0x1" edc:name="NCO1INC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC18" edc:desc="" edc:mask="0x1" edc:name="NCO1INC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC19" edc:desc="" edc:mask="0x1" edc:name="NCO1INC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC16" edc:mask="0x1" edc:name="INC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC17" edc:mask="0x1" edc:name="INC17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC18" edc:mask="0x1" edc:name="INC18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC19" edc:mask="0x1" edc:name="INC19" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:mask="0xf" edc:name="NCO1INC" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="NCO1CON" edc:desc="Configurable logic cell control" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="NCO1CON" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x446">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PFM" edc:desc="" edc:mask="0x1" edc:name="PFM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NCO1PFM" edc:mask="0x1" edc:name="NCO1PFM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NCO1POL" edc:mask="0x1" edc:name="NCO1POL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1OUT" edc:mask="0x1" edc:name="NCO1OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCO1EN" edc:mask="0x1" edc:name="NCO1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1CLK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1CLK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x447">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKS" edc:desc="" edc:mask="0x1f" edc:name="CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="PWS" edc:desc="" edc:mask="0x7" edc:name="PWS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKS0" edc:mask="0x1" edc:name="CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS1" edc:mask="0x1" edc:name="CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS2" edc:mask="0x1" edc:name="CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS3" edc:mask="0x1" edc:name="CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS4" edc:mask="0x1" edc:name="CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS0" edc:mask="0x1" edc:name="PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS1" edc:mask="0x1" edc:name="PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS2" edc:mask="0x1" edc:name="PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NCO1CKS" edc:mask="0x1f" edc:name="NCO1CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS" edc:mask="0x7" edc:name="NCO1PWS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="NCO1CKS0" edc:mask="0x1" edc:name="NCO1CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS1" edc:mask="0x1" edc:name="NCO1CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS2" edc:mask="0x1" edc:name="NCO1CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS3" edc:mask="0x1" edc:name="NCO1CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1CKS4" edc:mask="0x1" edc:name="NCO1CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS0" edc:mask="0x1" edc:name="NCO1PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS1" edc:mask="0x1" edc:name="NCO1PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1PWS2" edc:mask="0x1" edc:name="NCO1PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x448"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSCMCON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="FSCMCON" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x458">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSCMFEV" edc:mask="0x1" edc:name="FSCMFEV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMFFI" edc:mask="0x1" edc:name="FSCMFFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMPEV" edc:mask="0x1" edc:name="FSCMPEV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMPFI" edc:mask="0x1" edc:name="FSCMPFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMSEV" edc:mask="0x1" edc:name="FSCMSEV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMSFI" edc:mask="0x1" edc:name="FSCMSFI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="IVTLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="IVTLOCK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x459">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IVTLOCKED" edc:desc="" edc:mask="0x1" edc:name="IVTLOCKED" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="IVTAD" edc:desc="" edc:name="IVTAD" edc:nzwidth="0x10" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45A">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTADL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IVTADL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="AD0" edc:mask="0x1" edc:name="AD0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD1" edc:mask="0x1" edc:name="AD1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD2" edc:mask="0x1" edc:name="AD2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD3" edc:mask="0x1" edc:name="AD3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD4" edc:mask="0x1" edc:name="AD4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD5" edc:mask="0x1" edc:name="AD5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD6" edc:mask="0x1" edc:name="AD6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD7" edc:mask="0x1" edc:name="AD7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTADH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IVTADH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="AD8" edc:mask="0x1" edc:name="AD8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD9" edc:mask="0x1" edc:name="AD9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD10" edc:mask="0x1" edc:name="AD10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD11" edc:mask="0x1" edc:name="AD11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD12" edc:mask="0x1" edc:name="AD12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD13" edc:mask="0x1" edc:name="AD13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD14" edc:mask="0x1" edc:name="AD14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD15" edc:mask="0x1" edc:name="AD15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrnnnnn" edc:cname="IVTADU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IVTADU" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="AD16" edc:mask="0x1" edc:name="AD16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD17" edc:mask="0x1" edc:name="AD17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD18" edc:mask="0x1" edc:name="AD18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD19" edc:mask="0x1" edc:name="AD19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="AD20" edc:mask="0x1" edc:name="AD20" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
