garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IP" edc:mask="0x1" edc:name="INT1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7IP" edc:mask="0x1" edc:name="CLC7IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IP" edc:mask="0x1" edc:name="CWG1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IP" edc:mask="0x1" edc:name="NCO1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIP" edc:mask="0x1" edc:name="DMA2SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIP" edc:mask="0x1" edc:name="DMA2DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIP" edc:mask="0x1" edc:name="DMA2ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIP" edc:mask="0x1" edc:name="DMA2AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="IPR7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="IPR7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIP" edc:mask="0x1" edc:name="I2C1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIP" edc:mask="0x1" edc:name="I2C1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IP" edc:mask="0x1" edc:name="I2C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIP" edc:mask="0x1" edc:name="I2C1EIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IP" edc:mask="0x1" edc:name="CLC3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIP" edc:mask="0x1" edc:name="PWM3PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IP" edc:mask="0x1" edc:name="PWM3IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="IPR8" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="IPR8" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIP" edc:mask="0x1" edc:name="U2RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIP" edc:mask="0x1" edc:name="U2TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIP" edc:mask="0x1" edc:name="U2EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IP" edc:mask="0x1" edc:name="U2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC4IP" edc:mask="0x1" edc:name="CLC4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IP" edc:mask="0x1" edc:name="CCP2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIP" edc:mask="0x1" edc:name="SCANIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IPR9" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IPR9" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIP" edc:mask="0x1" edc:name="DMA3SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIP" edc:mask="0x1" edc:name="DMA3DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIP" edc:mask="0x1" edc:name="DMA3ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIP" edc:mask="0x1" edc:name="DMA3AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="IPR10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR10" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IP" edc:mask="0x1" edc:name="INT2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8IP" edc:mask="0x1" edc:name="CLC8IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BIP" edc:mask="0x1" edc:name="TU16BIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IP" edc:mask="0x1" edc:name="TMR4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIP" edc:mask="0x1" edc:name="DMA4SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIP" edc:mask="0x1" edc:name="DMA4DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIP" edc:mask="0x1" edc:name="DMA4ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIP" edc:mask="0x1" edc:name="DMA4AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnrnn" edc:cname="PIE0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIE" edc:mask="0x1" edc:name="SWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIE" edc:mask="0x1" edc:name="HLVDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIE" edc:mask="0x1" edc:name="OSFIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWIE" edc:mask="0x1" edc:name="CSWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIE" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IE" edc:mask="0x1" edc:name="CLC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIE" edc:mask="0x1" edc:name="IOCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
