garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F56Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IF" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH1IF" edc:mask="0x1" edc:name="ADCH1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIF" edc:mask="0x1" edc:name="ACTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1IF" edc:mask="0x1" edc:name="C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH2IF" edc:mask="0x1" edc:name="ADCH2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH3IF" edc:mask="0x1" edc:name="ADCH3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH4IF" edc:mask="0x1" edc:name="ADCH4IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="PIR2" edc:desc="" edc:impl="0x6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="PIR2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCDIF" edc:mask="0x1" edc:name="ZCDIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5IF" edc:mask="0x1" edc:name="CLC5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCSRIF" edc:mask="0x1" edc:name="IOCSRIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIF" edc:mask="0x1" edc:name="DMA1SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIF" edc:mask="0x1" edc:name="DMA1DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIF" edc:mask="0x1" edc:name="DMA1ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIF" edc:mask="0x1" edc:name="DMA1AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="PIR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IF" edc:mask="0x1" edc:name="SPI1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IF" edc:mask="0x1" edc:name="TMR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIF" edc:mask="0x1" edc:name="TMR1GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IF" edc:mask="0x1" edc:name="TMR0IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnrrrr" edc:cname="PIR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIF" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIF" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIF" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IF" edc:mask="0x1" edc:name="U1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IF" edc:mask="0x1" edc:name="TMR3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIF" edc:mask="0x1" edc:name="TMR3GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIF" edc:mask="0x1" edc:name="PWM1PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IF" edc:mask="0x1" edc:name="PWM1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnn-rn-" edc:cname="PIR5" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="PIR5" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC6IF" edc:mask="0x1" edc:name="CLC6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIF" edc:mask="0x1" edc:name="TU16AIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2IF" edc:mask="0x1" edc:name="C2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IF" edc:mask="0x1" edc:name="CLC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIF" edc:mask="0x1" edc:name="PWM2PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IF" edc:mask="0x1" edc:name="PWM2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IF" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7IF" edc:mask="0x1" edc:name="CLC7IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IF" edc:mask="0x1" edc:name="CWG1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IF" edc:mask="0x1" edc:name="NCO1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIF" edc:mask="0x1" edc:name="DMA2SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIF" edc:mask="0x1" edc:name="DMA2DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIF" edc:mask="0x1" edc:name="DMA2ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIF" edc:mask="0x1" edc:name="DMA2AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="PIR7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PIR7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIF" edc:mask="0x1" edc:name="I2C1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIF" edc:mask="0x1" edc:name="I2C1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IF" edc:mask="0x1" edc:name="I2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIF" edc:mask="0x1" edc:name="I2C1EIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IF" edc:mask="0x1" edc:name="CLC3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIF" edc:mask="0x1" edc:name="PWM3PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IF" edc:mask="0x1" edc:name="PWM3IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="PIR8" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PIR8" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4BA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIF" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIF" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIF" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IF" edc:mask="0x1" edc:name="U2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC4IF" edc:mask="0x1" edc:name="CLC4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IF" edc:mask="0x1" edc:name="CCP2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIF" edc:mask="0x1" edc:name="SCANIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="PIR9" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="PIR9" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4BB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIF" edc:mask="0x1" edc:name="DMA3SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIF" edc:mask="0x1" edc:name="DMA3DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIF" edc:mask="0x1" edc:name="DMA3ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIF" edc:mask="0x1" edc:name="DMA3AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="PIR10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR10" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4BC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IF" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8IF" edc:mask="0x1" edc:name="CLC8IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BIF" edc:mask="0x1" edc:name="TU16BIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IF" edc:mask="0x1" edc:name="TMR4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIF" edc:mask="0x1" edc:name="DMA4SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIF" edc:mask="0x1" edc:name="DMA4DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIF" edc:mask="0x1" edc:name="DMA4ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIF" edc:mask="0x1" edc:name="DMA4AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x19" edc:_addr="0x4BD"/>
        <edc:SFRDef edc:access="nnn--nnn" edc:cname="INTCON0" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--111" edc:name="INTCON0" edc:nzwidth="8" edc:por="000--111" edc:_modsrc="DOS-03056_int_8bit_v2_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4D6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0EDG" edc:desc="" edc:mask="0x1" edc:name="INT0EDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1EDG" edc:desc="" edc:mask="0x1" edc:name="INT1EDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2EDG" edc:desc="" edc:mask="0x1" edc:name="INT2EDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IPEN" edc:desc="" edc:mask="0x1" edc:name="IPEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GIEL" edc:desc="" edc:mask="0x1" edc:name="GIEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GIE" edc:desc="" edc:mask="0x1" edc:name="GIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="GIEH" edc:mask="0x1" edc:name="GIEH" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rr------" edc:cname="INTCON1" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------" edc:name="INTCON1" edc:nzwidth="8" edc:por="00------" edc:_modsrc="DOS-03056_int_8bit_v2_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x4D7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="STAT" edc:mask="0x3" edc:name="STAT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="STAT0" edc:mask="0x1" edc:name="STAT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STAT1" edc:mask="0x1" edc:name="STAT1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrnnnnn" edc:cname="STATUS" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="-1100000" edc:name="STATUS" edc:nzwidth="0x8" edc:por="-1100000" edc:_addr="0x4D8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
